src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераТелефонов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПривлечения</name>
    <type>
      <types>CatalogRef.ИсточникиПривлечения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>ДопРеквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контрагенты/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	СтруктураКонтактнойИнформации = ПолучитьКонтактыКонтрагента(ТекСтрока);
	ЮрАдрес		= СтруктураКонтактнойИнформации.ЮрАдрес;
	ФактАдрес	= СтруктураКонтактнойИнформации.ФактАдрес;
	Телефон		= СтруктураКонтактнойИнформации.Телефон;
	Email		= СтруктураКонтактнойИнформации.Email;
	
КонецПроцедуры                                                 

&НаСервереБезКонтекста
Функция ПолучитьКонтактыКонтрагента(Контрагент)
	
	СтруктураДанных = Новый Структура("ЮрАдрес, ФактАдрес, Телефон, Email");
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();                         
	ВидКИ_ЮрАдрес	= Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ВидКИ_ФактАдрес	= Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ВидКИ_Email		= Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	ВидКИ_Телефон	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	
	Для каждого СтрокаТЧ Из КонтрагентОбъект.КонтактнаяИнформация Цикл
		Если СтрокаТЧ.Вид = ВидКИ_ЮрАдрес Тогда
			СтруктураДанных.ЮрАдрес = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = ВидКИ_ФактАдрес Тогда    
			СтруктураДанных.ФактАдрес = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = ВидКИ_Телефон Тогда    
			СтруктураДанных.Телефон = СтрокаТЧ.Значение;
		ИначеЕсли СтрокаТЧ.Вид = ВидКИ_Email Тогда    
			СтруктураДанных.Email = СтрокаТЧ.Значение;
		КонецЕсли;		
	
	КонецЦикла;
	
	Возврат СтруктураДанных;

КонецФункции // ПолучитьКонтактыКонтрагента()
